#include "board.h"
#include "delay.h"
/**************************************************************
***	接线：
		*	PA5接En（闭环驱动板屏幕上的En选项选择L或Hold） //
		*	PA6接Stp			//低电平
		*	PA7接Dir //   //低电平
		*	V+和Gnd接10~28V供电
		*	非工业套餐（不带光耦隔离）要把STM32控制板的Gnd和闭环驱动板的Gnd接在一起（共地）
***	注意事项：
		*	STM32控制板和闭环驱动板的两个Gnd要接在一起
		*	先接好线再通电，不要带电拔插！！！
		*	上电时，先通10~28V供电，再通STM32控制板USB供电！！！避免一些效应造成损坏
		*	断电时，先断STM32控制板USB供电，再断10~28V供电。
***************************************************************/
int main (void)
{	
	__IO int32_t i = 0, j = 0;	__IO bool cntDir = false;

/**********************************************************
***	初始化板载外设
**********************************************************/
	board_init();
	
/**********************************************************
***	延时1.2秒等待闭环驱动板上电初始化完毕
**********************************************************/	
	delay_ms(1200);

/**********************************************************
***	发脉冲控制
**********************************************************/
	while(1)
	{
/**********************************************************
***	高低电平的时间间隔，即脉冲时间的一半(控制电机转动速度)
**********************************************************/
		j = 6400;	while(j--); //3200 1.248khz     6400  624hz   12800  312hz

/**********************************************************
***	异或取反PA6（Stp引脚）
**********************************************************/
		GPIOA->ODR ^= GPIO_Pin_6;

/**********************************************************
***	记录IO取反次数（IO取反次数 = 2倍的脉冲数）
**********************************************************/
		if(cntDir)	{--i;}	else	{++i;}

/**********************************************************
***	PA6（Stp引脚）取反了6400次，即发送了3200个脉冲
***	16细分下，发送3200个脉冲电机转动一圈（1.8度电机）  4圈
**********************************************************/
		if(i >= 25600)
		{
			GPIO_SetBits(GPIOA, GPIO_Pin_7);	cntDir = true;	delay_ms(1000);		//切换方向转动
		}
		else if(i == 0)
		{
			GPIO_ResetBits(GPIOA, GPIO_Pin_7);	cntDir = false;	delay_ms(1000);	//切换方向转动
		}
	}
}

